app/Http/Controllers/Home/AchievementController.php

select "id", "year" from "periods" order by "year" desc
---
    public function index()
    {
        $achievements = Period::select('id', 'year')
        ->with(['achievements:id,period_id,title', 'achievements.achievement_descriptions:id,achievement_id,description_text'])
        ->orderBy('year', 'desc')
        ->get();