app/Http/Controllers/Home/HomePageController.php

select "id", "title", "stat", "description" from "home_stats" order by "id" asc
---
    public function index()
    {
        $homestats = HomeStat::select("id","title","stat","description")->orderBy("id")->get();