app/Http/Controllers/AchievementManagementController.php

select "id", "year" from "periods" order by "created_at" desc
---
    public function index()
    {
        $achievements = Achievement::select('id', 'title', 'period_id')->with(['period:id,year'])->latest()->get();