app/Http/Controllers/AdminController.php

    public function index()
    {
        $pages = Page::select('id', 'name', 'route_name')->get();
---
select "id", "name", "route_name" from "pages"