app/Http/Controllers/BusinessManagementController.php

select * from "businesses"
---
    public function index()
    {
        $businesses = Business::all();

select * from "business_branches" where "business_branches"."business_id" in (1)
select * from "business_images" where "business_images"."business_id" in (1)
select * from "business_sections" where "business_sections"."business_id" in (1)
select * from "business_socials" where "business_socials"."business_id" in (1)
---
    public function show(Business $business)
    {
        $business->load(['business_socials', 'business_sections', 'business_images', 'business_branches']);

insert into "businesses" ("name", "description", "category", "updated_at", "created_at") values ('test', 'test desc', 'office', '2026-03-03 02:13:44', '2026-03-03 02:13:44')
---
    public function storeBusiness(Request $request){
        // dd($request);
        $fields = $request->validate([
            'name' => ['required','string',''],
            'description' => ['required','string',''],
            'category' => ['required','string',''],

        ]);

        Business::create($fields);

insert into "business_socials" ("business_id", "platform_name", "url", "updated_at", "created_at") values (1, 'hahaha', 'hahaha', '2026-03-03 02:01:20', '2026-03-03 02:01:20')
---
    public function storeSocial(Request $request)
    {
        // dd($request);
        $fields = $request->validate([
            'business_id' => ['required', 'exists:businesses,id'],
            'platform_name' => 'required|string',
            'url' => 'required'
        ]);

        BusinessSocial::create($fields);

update "businesses" set "name" = 'Casa Jedliana asad', "updated_at" = '2026-03-03 02:34:10' where "id" = 5
---
    public function updateBusiness(Request $request, Business $business) {
        $updated = $request->validate([
            'name' => ['required','string',''],
            'description' => ['required','string',''],
            'category' => ['required','string',''],
        ]);

        $business->update($updated);